; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared5 - mode
	image1 - mode
	thermograph2 - mode
	infrared0 - mode
	infrared3 - mode
	spectrograph8 - mode
	spectrograph4 - mode
	spectrograph6 - mode
	infrared7 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph8)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
)
(:goal (and
	(have_image Planet5 infrared5)
	(have_image Planet6 spectrograph6)
	(have_image Planet6 spectrograph8)
	(have_image Planet6 infrared7)
	(have_image Planet7 infrared7)
	(have_image Planet7 spectrograph4)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon8 infrared7)
	(have_image Phenomenon8 spectrograph8)
	(have_image Star9 infrared3)
	(have_image Star9 infrared7)
	(have_image Star10 infrared5)
	(have_image Star10 spectrograph4)
	(have_image Star10 infrared7)
	(have_image Star11 spectrograph4)
	(have_image Planet12 infrared5)
	(have_image Star13 thermograph2)
	(have_image Star13 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation3 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 18
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 18
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 18
4. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 0 of 18
5. (take_image satellite0 star11 instrument0 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 1 of 18
6. (turn_to satellite0 planet7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet7)
   goals met: 1 of 18
7. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 2 of 18
8. (take_image satellite0 planet7 instrument0 infrared7)
   added: (have_image planet7 infrared7)
   goals met: 3 of 18
9. (turn_to satellite0 planet5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet5)
   goals met: 3 of 18
10. (take_image satellite0 planet5 instrument0 infrared5)
   added: (have_image planet5 infrared5)
   goals met: 4 of 18
11. (turn_to satellite0 planet12 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet12)
   goals met: 4 of 18
12. (take_image satellite0 planet12 instrument0 infrared5)
   added: (have_image planet12 infrared5)
   goals met: 5 of 18
13. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 18
14. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 6 of 18
15. (take_image satellite0 phenomenon8 instrument0 spectrograph8)
   added: (have_image phenomenon8 spectrograph8)
   goals met: 7 of 18
16. (take_image satellite0 phenomenon8 instrument0 infrared7)
   added: (have_image phenomenon8 infrared7)
   goals met: 8 of 18
17. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 8 of 18
18. (take_image satellite0 planet6 instrument0 infrared7)
   added: (have_image planet6 infrared7)
   goals met: 9 of 18
19. (take_image satellite0 planet6 instrument0 spectrograph6)
   added: (have_image planet6 spectrograph6)
   goals met: 10 of 18
20. (take_image satellite0 planet6 instrument0 spectrograph8)
   added: (have_image planet6 spectrograph8)
   goals met: 11 of 18
21. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 11 of 18
22. (take_image satellite0 star10 instrument0 infrared5)
   added: (have_image star10 infrared5)
   goals met: 12 of 18
23. (take_image satellite0 star10 instrument0 infrared7)
   added: (have_image star10 infrared7)
   goals met: 13 of 18
24. (take_image satellite0 star10 instrument0 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 14 of 18
25. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 14 of 18
26. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 15 of 18
27. (take_image satellite0 star13 instrument0 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 16 of 18
28. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 16 of 18
29. (take_image satellite0 star9 instrument0 infrared3)
   added: (have_image star9 infrared3)
   goals met: 17 of 18
30. (take_image satellite0 star9 instrument0 infrared7)
   added: (have_image star9 infrared7)
   goals met: 18 of 18
